load-test.yml
config:
  target: 'http://localhost:9004'
  phases:
    - duration: 60
      arrivalRate: 100
scenarios:
  - flow:
      - get:
          url: "/reviews/audience/${{randomnumber(8888888,9999999)}}"

  - flow:
      - post:
          url: "/reviews/audience/{{randomnumber(8000000,9000000}}"
          json:
              id: "26375"
              review: "This movie sucks"
              user_id: "47"
              movie_id: "489999"
              stars: "3"